"""
Завдання 2. Задача 11. Побудувати масив А=(ai), елементи якого задаються формулою
Вивести добуток елементів масиву А з парними індексами.
"""
"""
dob - добуток елементів парних індексів
ai - елементи
i - індекс
n - кількість індексів
f - факторіал
b - чисельник
p - парні числа
"""
dob = 1
f = 1
b = 1
num_a = 0
n = int(input('Введіть n: '))
a = []
for i in range(1, n):
    num_a += int(b/f)
    f *= i
    b += (1/i)
    a.append(num_a)
print("A = {0}".format(a))
i = 0
for i in range(len(a)):
    if i % 2 == 1:
        num = a[i]
        dob *= num
print("Добуток = {0}".format(dob))
